IvanRuzavin/NECTO_SDK_Rust/gui/core_packages/startup/stm/stm32h7s3a8.s
   .weak      SAI1_A_IRQHandler
   .thumb_set SAI1_A_IRQHandler,Default_Handler

   .weak      SAI1_B_IRQHandler
   .thumb_set SAI1_B_IRQHandler,Default_Handler

   .weak      SAI2_A_IRQHandler
   .thumb_set SAI2_A_IRQHandler,Default_Handler

   .weak      SAI2_B_IRQHandler
   .thumb_set SAI2_B_IRQHandler,Default_Handler

   .weak      I2C1_EV_IRQHandler
   .thumb_set I2C1_EV_IRQHandler,Default_Handler

   .weak      I2C1_ER_IRQHandler
   .thumb_set I2C1_ER_IRQHandler,Default_Handler

   .weak      I2C2_EV_IRQHandler
   .thumb_set I2C2_EV_IRQHandler,Default_Handler

   .weak      I2C2_ER_IRQHandler
   .thumb_set I2C2_ER_IRQHandler,Default_Handler

   .weak      I2C3_EV_IRQHandler
   .thumb_set I2C3_EV_IRQHandler,Default_Handler

   .weak      I2C3_ER_IRQHandler
   .thumb_set I2C3_ER_IRQHandler,Default_Handler

   .weak      UART1_IRQHandler
   .thumb_set UART1_IRQHandler,Default_Handler

   .weak      UART2_IRQHandler
   .thumb_set UART2_IRQHandler,Default_Handler

   .weak      UART3_IRQHandler
   .thumb_set UART3_IRQHandler,Default_Handler

   .weak      UART4_IRQHandler
   .thumb_set UART4_IRQHandler,Default_Handler

   .weak      UART5_IRQHandler
   .thumb_set UART5_IRQHandler,Default_Handler

   .weak      UART7_IRQHandler
   .thumb_set UART7_IRQHandler,Default_Handler

   .weak      UART8_IRQHandler
   .thumb_set UART8_IRQHandler,Default_Handler

   .weak      I3C1_EV_IRQHandler
   .thumb_set I3C1_EV_IRQHandler,Default_Handler

   .weak      I3C1_ER_IRQHandler
   .thumb_set I3C1_ER_IRQHandler,Default_Handler

   .weak      OTG_HS_IRQHandler
   .thumb_set OTG_HS_IRQHandler,Default_Handler

   .weak      ETH_IRQHandler
   .thumb_set ETH_IRQHandler,Default_Handler

   .weak      CORDIC_IRQHandler
   .thumb_set CORDIC_IRQHandler,Default_Handler

   .weak      GFXTIM_IRQHandler
   .thumb_set GFXTIM_IRQHandler,Default_Handler

   .weak      DCMIPP_IRQHandler
   .thumb_set DCMIPP_IRQHandler,Default_Handler

   .weak      DMA2D_IRQHandler
   .thumb_set DMA2D_IRQHandler,Default_Handler

   .weak      JPEG_IRQHandler
   .thumb_set JPEG_IRQHandler,Default_Handler

   .weak      GFXMMU_IRQHandler
   .thumb_set GFXMMU_IRQHandler,Default_Handler

   .weak      I3C1_WKUP_IRQHandler
   .thumb_set I3C1_WKUP_IRQHandler,Default_Handler

   .weak      MCE1_IRQHandler
   .thumb_set MCE1_IRQHandler,Default_Handler

   .weak      MCE2_IRQHandler
   .thumb_set MCE2_IRQHandler,Default_Handler

   .weak      MCE3_IRQHandler
   .thumb_set MCE3_IRQHandler,Default_Handler

   .weak      XSPI1_IRQHandler
   .thumb_set XSPI1_IRQHandler,Default_Handler

   .weak      XSPI2_IRQHandler
   .thumb_set XSPI2_IRQHandler,Default_Handler

   .weak      FMC_IRQHandler
   .thumb_set FMC_IRQHandler,Default_Handler

   .weak      SDMMC1_IRQHandler
   .thumb_set SDMMC1_IRQHandler,Default_Handler

   .weak      SDMMC2_IRQHandler
   .thumb_set SDMMC2_IRQHandler,Default_Handler

   .weak      OTG_FS_IRQHandler
   .thumb_set OTG_FS_IRQHandler,Default_Handler

   .weak      TIM12_IRQHandler
   .thumb_set TIM12_IRQHandler,Default_Handler

   .weak      TIM13_IRQHandler
   .thumb_set TIM13_IRQHandler,Default_Handler

   .weak      TIM14_IRQHandler
   .thumb_set TIM14_IRQHandler,Default_Handler

   .weak      TIM15_IRQHandler
   .thumb_set TIM15_IRQHandler,Default_Handler

   .weak      TIM16_IRQHandler
   .thumb_set TIM16_IRQHandler,Default_Handler

   .weak      TIM17_IRQHandler
   .thumb_set TIM17_IRQHandler,Default_Handler

   .weak      LPTIM1_IRQHandler
   .thumb_set LPTIM1_IRQHandler,Default_Handler

   .weak      LPTIM2_IRQHandler
   .thumb_set LPTIM2_IRQHandler,Default_Handler

   .weak      LPTIM3_IRQHandler
   .thumb_set LPTIM3_IRQHandler,Default_Handler

   .weak      LPTIM4_IRQHandler
   .thumb_set LPTIM4_IRQHandler,Default_Handler

   .weak      LPTIM5_IRQHandler
   .thumb_set LPTIM5_IRQHandler,Default_Handler

   .weak      SPDIF_RX_IRQHandler
   .thumb_set SPDIF_RX_IRQHandler,Default_Handler

   .weak      MDIOS_IRQHandler
   .thumb_set MDIOS_IRQHandler,Default_Handler

   .weak      ADF1_FLT0_IRQHandler
   .thumb_set ADF1_FLT0_IRQHandler,Default_Handler

   .weak      CRS_IRQHandler
   .thumb_set CRS_IRQHandler,Default_Handler

   .weak      UCPD1_IRQHandler
   .thumb_set UCPD1_IRQHandler,Default_Handler

   .weak      CEC_IRQHandler
   .thumb_set CEC_IRQHandler,Default_Handler

   .weak      PSSI_IRQHandler
   .thumb_set PSSI_IRQHandler,Default_Handler

   .weak      LPUART1_IRQHandler
   .thumb_set LPUART1_IRQHandler,Default_Handler

   .weak      WAKEUP_PIN_IRQHandler
   .thumb_set WAKEUP_PIN_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel8_IRQHandler
   .thumb_set GPDMA1_Channel8_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel9_IRQHandler
   .thumb_set GPDMA1_Channel9_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel10_IRQHandler
   .thumb_set GPDMA1_Channel10_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel11_IRQHandler
   .thumb_set GPDMA1_Channel11_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel12_IRQHandler
   .thumb_set GPDMA1_Channel12_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel13_IRQHandler
   .thumb_set GPDMA1_Channel13_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel14_IRQHandler
   .thumb_set GPDMA1_Channel14_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel15_IRQHandler
   .thumb_set GPDMA1_Channel15_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel8_IRQHandler
   .thumb_set HPDMA1_Channel8_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel9_IRQHandler
   .thumb_set HPDMA1_Channel9_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel10_IRQHandler
   .thumb_set HPDMA1_Channel10_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel11_IRQHandler
   .thumb_set HPDMA1_Channel11_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel12_IRQHandler
   .thumb_set HPDMA1_Channel12_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel13_IRQHandler
   .thumb_set HPDMA1_Channel13_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel14_IRQHandler
   .thumb_set HPDMA1_Channel14_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel15_IRQHandler
   .thumb_set HPDMA1_Channel15_IRQHandler,Default_Handler

   .weak      FDCAN1_IT0_IRQHandler
   .thumb_set FDCAN1_IT0_IRQHandler,Default_Handler

   .weak      FDCAN1_IT1_IRQHandler
   .thumb_set FDCAN1_IT1_IRQHandler,Default_Handler

   .weak      FDCAN2_IT0_IRQHandler
   .thumb_set FDCAN2_IT0_IRQHandler,Default_Handler

   .weak      FDCAN2_IT1_IRQHandler
   .thumb_set FDCAN2_IT1_IRQHandler,Default_Handler

   .weak      SystemInit
